const mediaFiles = {
  polatoka: "/polatoka.mp3",
  dhandharthekeo: "/dhandharthekeo.mp3",
  sanamcomposition: "/sanamcomposition.mp3",
  sanamVideo: "/sanam.mp4",
  rpVideo: "/rp.mp4",
  ekaekaVideo: "/sheyje_arijit_square.mp4",
  ending:"/Ending.mp4"
};

const images = {
  sanamImage: "/sanam.jpg",
  rpImage: "/rp.jpg",
  sanjsketch: "/sanjsketch.jpg",
  avatarImage: "/som.svg",
};

export { mediaFiles, images };

export const LYRICS = [
  "👀",
  "শুভ জন্মদিন!",
"এটা তোমার জন্য আমার পক্ষ থেকে এক বিশেষ উপহার। 😊",
"সেই গজদন্ত হাসিটা রেখে পুরোটা শুরু থেকে শেষ পর্যন্ত পড়ে দেখো, ধৈর্য ধরে।",
"প্রতিটি লেখায় ভালোবাসা মিশিয়ে দিয়েছি।",
"তোকে খুব ভালোবাসি, সবসময় মনে করি।",
"তবে মন খারাপ করার কিছু নেই।",
"তুই নিজেকে খেয়াল রাখিস।",
"জানি এটা পড়ে হাসি চেপে রাখার চেষ্টা করছিস। 😄",
"একদিন সবাই মিলে ঘুরতে যাব, অনেক আনন্দ করবো।",
"তুই তো বললি না কোন গানটা তোর প্রিয়, তাই আমি বাশির এই মাশআপটা দিলাম।",
"যত্নে থাকিস রে মা, রোজ তাড়াতাড়ি ঘুমোতে যাস।",
"প্রার্থনা করি, তোর জীবনে সব সময়ে সেই মানুষগুলো থাকুক, যাদের সঙ্গে তুই থাকতে চাস।",
"এটা মায়ের কাছেও দেখাস, কিছুই অস্বস্তির কারণ নেই। 😌",
"আবারও, শুভ জন্মদিন! 🎉",
"এখনো মনে পড়ে আমাদের প্রথম দেখা, সেই দিনটা যেন কালকের মতোই মনে হয়।",
"তুই যেভাবে আমাকে হাসতে শিখিয়েছিস, সেটা আমি কোনদিন ভুলতে পারব না।",
"তোর মতো বন্ধুর জন্য আমি সবসময় কৃতজ্ঞ।",
"তোর হাসি, তোর কণ্ঠ, তোর সব কিছুই আমার কাছে বিশেষ।",
"তুই আমার জীবনে আলো নিয়ে এসেছিস, সেটা আমি কখনোই ভুলব না।",
"তুই সবসময় জানবি, তুই আমার জীবনের এক অমূল্য অংশ।",
"আশা করি তোর এই জন্মদিনটা অনেক আনন্দে কাটবে।",
"তুই যেখানেই থাকিস, সবসময় হাসিখুশি থাকিস, সেটা আমি চাই।",
"ভালো থাকিস, অনেক ভালোবাসা তোকে।",
];

export const MUSIC = {
  POLATOKA: mediaFiles.polatoka,
  DHANDHAR_THEKEO: mediaFiles.dhandharthekeo,
  SANAM: mediaFiles.sanamcomposition,
};

export const MEDIA = {
  SANAM_IMG: images.sanamImage,
  RP_IMG: images.rpImage,
  SANJ_SKETCH: images.sanjsketch,
  SANAM_VIDEO: mediaFiles.sanamVideo,
  RP_VIDEO: mediaFiles.rpVideo,
  AVATAR_IMG: images.avatarImage,
  SHEY_JE_VIDEO: mediaFiles.ekaekaVideo,
  ENDING :mediaFiles.ending
};

export const GITHUB_URI = "https://github.com/prajak002/";

export const DARK_SCREEN = 0.95;
export const LIGHT_SCREEN = 0.05;
